n5/src/Documents/Entry/Entry.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>Entry</name>
  <registerRecords>AccountingRegister.General</registerRecords>
  <attributes>
    <name>Amount</name>
    <type>
      <types>DefinedType.Amount</types>
    </type>
  </attributes>
  <attributes>
    <name>Company</name>
    <type>
      <types>CatalogRef.Companies</types>
    </type>
  </attributes>
  <attributes>
    <name>Creator</name>
    <type>
      <types>CatalogRef.Users</types>
    </type>
  </attributes>
  <attributes>
    <name>Memo</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Method</name>
    <type>
      <types>EnumRef.Operations</types>
    </type>
  </attributes>
  <attributes>
    <name>Operation</name>
    <type>
      <types>CatalogRef.Operations</types>
    </type>
  </attributes>
  <attributes>
    <name>PaymentContent</name>
    <type>
      <types>DefinedType.PaymentContent</types>
    </type>
  </attributes>
  <attributes>
    <name>Reference</name>
    <type>
      <types>DefinedType.Reference</types>
    </type>
  </attributes>
  <attributes>
    <name>ReferenceDate</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Simple</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Records</name>
    <attributes>
      <name>AccountCr</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>AccountDr</name>
      <type>
        <types>ChartOfAccountsRef.General</types>
      </type>
    </attributes>
    <attributes>
      <name>Amount</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>AmountCr</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>AmountDr</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>Content</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>CrClass</name>
      <type>
        <types>EnumRef.Accounts</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyAmountCr</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyAmountDr</name>
      <type>
        <types>DefinedType.Amount</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyCr</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>CurrencyDr</name>
      <type>
        <types>CatalogRef.Currencies</types>
      </type>
    </attributes>
    <attributes>
      <name>DimCr1</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimCr2</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimCr3</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimDr1</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimDr2</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DimDr3</name>
      <type>
        <types>Characteristic.Dimensions</types>
      </type>
    </attributes>
    <attributes>
      <name>DrClass</name>
      <type>
        <types>EnumRef.Accounts</types>
      </type>
    </attributes>
    <attributes>
      <name>FactorCr</name>
      <type>
        <types>DefinedType.Factor</types>
      </type>
    </attributes>
    <attributes>
      <name>FactorDr</name>
      <type>
        <types>DefinedType.Factor</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityCr</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>QuantityDr</name>
      <type>
        <types>DefinedType.Quantity</types>
      </type>
    </attributes>
    <attributes>
      <name>RateCr</name>
      <type>
        <types>DefinedType.Rate</types>
      </type>
    </attributes>
    <attributes>
      <name>RateDr</name>
      <type>
        <types>DefinedType.Rate</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

n5/src/Documents/Entry/ObjectModule.bsl
#if ( Server or ThickClientOrdinaryApplication or ExternalConnection ) then

Procedure FillCheckProcessing ( Cancel, CheckedAttributes )
	
	if ( not checkBalance () ) then
		Cancel = true;
	endif;
	
EndProcedure

Function checkBalance ()
	
	if ( Records.Total ( "AmountDr" ) <> Records.Total ( "AmountCr" ) ) then
		Output.EntryNotInBalance ( , "Records", Ref );
		return false;
	endif;
	return true;
	
EndFunction

Procedure OnWrite ( Cancel )
	
	if ( DataExchange.Load ) then
		return;
	endif;
	PettyCash.Sync ( ThisObject );
	
EndProcedure

Procedure Posting ( Cancel, PostingMode )
	
	env = Posting.GetParams ( Ref, RegisterRecords );
	Cancel = not Documents.Entry.Post ( env );
	
EndProcedure

Procedure OnSetNewNumber ( StandardProcessing, Prefix )
	
	StandardProcessing = false;
	numerator = getNumerator ();
	Prefix = Application.Prefix () + DF.Pick ( Company, "Prefix" ) + numerator.Prefix;
	numberLen = Metadata.Documents.Entry.NumberLength;
	Number = Prefix + Right ( numerator.Code, numberLen - StrLen ( Prefix ) );
	
EndProcedure

Function getNumerator () 
	
	transaction = not TransactionActive ();
	if ( transaction ) then
		BeginTransaction ();
	endif;
	numerator = DF.Pick ( Operation, "Numerator" );
	lockNumerator ( numerator );
	if ( numerator.IsEmpty () ) then
		prefix = "";
		numerator = Catalogs.Numeration.Default;
	else
		prefix = DF.Pick ( numerator, "Description" );
	endif;
	code = getCode ( numerator );
	if ( transaction ) then
		CommitTransaction ();
	endif;
	return new Structure ( "Prefix, Code", prefix, code );

EndFunction

Procedure lockNumerator ( Numerator )
	
	lock = new DataLock ();
	item = lock.Add ( "Catalog.Numeration" );
	item.SetValue ( "Ref", Numerator );
	item.Mode = DataLockMode.Exclusive;
	lock.Lock ();
	
EndProcedure

Function getCode ( Numerator ) 
	
	obj = Catalogs.Numeration.CreateItem ();
	obj.SetNewCode ( "" + Numerator );
	code = obj.Code;
	obj = Numerator.GetObject ();
	obj.Code = code;
	obj.Write ();
	return code;
	
EndFunction

#endif
